# -*- coding: utf-8 -*-
# Это программа для разработки, если вы случайно тут, то выйдите, пожалуйста, и ничего не ломайте
# ID меняется вручную, молю всех не продолбить это (я перед экзом поревьюю, но не обещаю)
# если вы не уверены в задаче, но хотите ее добавить в базу, пишите тем, кто знает тервер чтобы проверили
# если вы считаете, что это говнокод и соберете лучше -- пишите свою либу и шерьте со всеми
# если вы пришли с фичреквестом -- пишите dashkaz или rozyev23

import json
import scipy.stats
import statistics
import pathlib


my_own_task = {
    "id" : 1,
    "unit": "q2",
    "task_text": r'13. По выборке X1, X2, . . . , Xn объема n из нормального закона распределения N(µ; σ2), когда µ = E(X)– известно, проверяется на уровне значимости α основная гипотеза H0 : σ = σ0 против альтернативной гипотезы H1 : σ 6= σ0. 1) Приведите необходимую статистику критерия и критическое множество для проверки H0 против H1. 2) Приведите (с доказательством) основные свойства критерия. 3) Приведите (с выводом) выражение для P-значения критерия.',
    "task_solution_code_analytics":
        """
emelib.solve_another_strange_number_13()
        """
}
new_task = json.dumps(my_own_task, ensure_ascii=False)
with open(pathlib.Path(pathlib.Path(pathlib.Path.cwd(), "tasks_base.txt")), "a", encoding="UTF8") as f:
    f.write(new_task)
    f.write("\n")
